Sowa.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Sowa</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-07-17 12:22:48 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Sowa</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Sowa.org </a>
<ul>
<li><a href="#sec-1.1">1.1 Summary of Notations </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 Predicate Calculus </a></li>
<li><a href="#sec-1.1.2">1.1.2 Conceptual Graphs </a></li>
<li><a href="#sec-1.1.3">1.1.3 Knowledge Interchange Format </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 Ontology </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Sowa.org </h2>
<div class="outline-text-2" id="text-1">

<p>For decades, John Sowa has been one of the leading lights
in the discipline of Knowledge Representation. This document
collects notes on his work.
</p>
</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Summary of Notations </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Predicate Calculus </h4>
<div class="outline-text-4" id="text-1.1.1">

<p>Symbolic logic has two main branches: <i>propositional logic</i> and <i>predicate logic</i>.
</p>
<p>
Propositional logic treats propositions as single units.
(<i>p</i> -&gt; "Trailer trucks have 18 wheels.")
</p>
<p>
Predicate logic analyzes propositions into combinations of predicates.
(<i>trailerTruck(x)</i> and <i>wheel(x)</i> are examples of predicates)
</p>
<p>
A <i>predicate</i> or <i>relation</i> is a function that maps its arguments
to the <i>truth values</i> 1/0 or T/F.
</p>
<p>
<i>Less than</i> (&lt;) is a good example of a predicate. 
</p>



<pre class="example">(&lt; 5 12) =&gt; T
(&lt; 12 5) =&gt; F
</pre>



</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> Conceptual Graphs </h4>
<div class="outline-text-4" id="text-1.1.2">

</div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> Knowledge Interchange Format </h4>
<div class="outline-text-4" id="text-1.1.3">

</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Ontology </h3>
<div class="outline-text-3" id="text-1.2">

<p>Sowa's Ontology is described in detail in his book 
<i>Knowledge Representation</i>. Page 72 presents the 
top three distinctions in lattice form.
</p>
<p>
The three distinctions are:
</p><ul>
<li>
I/R/M (Independent/Relative/Mediating) 
</li>
<li>
P/A   (Physical/Abstract)
</li>
<li>
C/O   (Continuant/Occurrent)

</li>
</ul>

<p>Combinations of distinctions:
</p><ul>
<li>
IP (Actuality)
</li>
<li>
IA (Form)
</li>
<li>
RP (Prehension)
</li>
<li>
RA (Proposition)
</li>
<li>
MP (Nexus)
</li>
<li>
MA (Intention)

</li>
</ul>

<p>Three letter concepts
</p><ul>
<li>
IPC (Object)
</li>
<li>
IPO (Process)
</li>
<li>
IAC (Schema)
</li>
<li>
IAO (Script)
</li>
<li>
RPC (Juncture)
</li>
<li>
RPO (Participation)
</li>
<li>
RAC (Description)
</li>
<li>
RAO (History)
</li>
<li>
MPC (Structure)
</li>
<li>
MPO (Situation)
</li>
<li>
MAC (Reason)
</li>
<li>
MAO (Purpose)

</li>
</ul>

<p>The purpose of the ontology is to provide a framework
of distinctions that can be used to discriminate and
classify the things that exist and define the words 
that describe them.
</p>
<p>
But no fixed collection of distinctions or categories
is likely to be adequate for describing all things 
for all time.
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-07-17 12:22:48 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
